In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("F:\PGDDS\PGD_Data_Science\csv_data\Bengaluru_House_Data.csv")

In [3]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
df.shape

(13320, 9)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [6]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [7]:
df.drop(['area_type', 'availability', 'society','balcony'], axis = 1, inplace = True)

In [8]:
df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [10]:
df.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [11]:
df.dropna(inplace = True)

In [12]:
df.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [13]:
df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [14]:
df['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [15]:
df['bhk'] = df['size'].apply(lambda x : int(x.split(' ')[0]))

In [16]:
df.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [17]:
df1 = df.drop('size', axis = 1)

In [18]:
df1.head()

                   location total_sqft  bath   price  bhk
0  Electronic City Phase II       1056   2.0   39.07    2
1          Chikka Tirupathi       2600   5.0  120.00    4
2               Uttarahalli       1440   2.0   62.00    3
3        Lingadheeranahalli       1521   3.0   95.00    3
4                  Kothanur       1200   2.0   51.00    2

In [19]:
df['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [20]:
df['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [21]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [22]:
df1[df1['total_sqft'].apply(is_float)]

                       location total_sqft  bath   price  bhk
0      Electronic City Phase II       1056   2.0   39.07    2
1              Chikka Tirupathi       2600   5.0  120.00    4
2                   Uttarahalli       1440   2.0   62.00    3
3            Lingadheeranahalli       1521   3.0   95.00    3
4                      Kothanur       1200   2.0   51.00    2
...                         ...        ...   ...     ...  ...
13315                Whitefield       3453   4.0  231.00    5
13316             Richards Town       3600   5.0  400.00    4
13317     Raja Rajeshwari Nagar       1141   2.0   60.00    2
13318           Padmanabhanagar       4689   4.0  488.00    4
13319              Doddathoguru        550   1.0   17.00    1

[13056 rows x 5 columns]

In [23]:
df1.shape

(13246, 5)

In [24]:
df1[~df1['total_sqft'].apply(is_float)]

                 location   total_sqft  bath    price  bhk
30              Yelahanka  2100 - 2850   4.0  186.000    4
122                Hebbal  3067 - 8156   4.0  477.000    4
137    8th Phase JP Nagar  1042 - 1105   2.0   54.005    2
165              Sarjapur  1145 - 1340   2.0   43.490    2
188              KR Puram  1015 - 1540   2.0   56.800    2
...                   ...          ...   ...      ...  ...
12975          Whitefield   850 - 1060   2.0   38.190    2
12990      Talaghattapura  1804 - 2273   3.0  122.000    3
13059              Harlur  1200 - 1470   2.0   72.760    2
13265               Hoodi  1133 - 1384   2.0   59.135    2
13299          Whitefield  2830 - 2882   5.0  154.500    4

[190 rows x 5 columns]

In [25]:
df1[~df1['total_sqft'].apply(is_float)].head(12)

                  location      total_sqft  bath    price  bhk
30               Yelahanka     2100 - 2850   4.0  186.000    4
122                 Hebbal     3067 - 8156   4.0  477.000    4
137     8th Phase JP Nagar     1042 - 1105   2.0   54.005    2
165               Sarjapur     1145 - 1340   2.0   43.490    2
188               KR Puram     1015 - 1540   2.0   56.800    2
410                Kengeri  34.46Sq. Meter   1.0   18.500    1
549            Hennur Road     1195 - 1440   2.0   63.770    2
648                Arekere       4125Perch   9.0  265.000    9
661              Yelahanka     1120 - 1145   2.0   48.130    2
672           Bettahalsoor     3090 - 5002   4.0  445.000    4
772  Banashankari Stage VI     1160 - 1195   2.0   59.935    2
775           Basavanagara   1000Sq. Meter   2.0   93.000    1

In [26]:
def convert(x):
    l = x.split(' - ')
    if len(l) == 2:
        return(float(l[0]) + (float(l[1])) / 2)
    try:
        return float(x)
    except:
        return None

In [27]:
df2 = df1.copy()

In [28]:
df2.head()

                   location total_sqft  bath   price  bhk
0  Electronic City Phase II       1056   2.0   39.07    2
1          Chikka Tirupathi       2600   5.0  120.00    4
2               Uttarahalli       1440   2.0   62.00    3
3        Lingadheeranahalli       1521   3.0   95.00    3
4                  Kothanur       1200   2.0   51.00    2

In [29]:
df2['total_sqft'] = df2['total_sqft'].apply(convert)

In [30]:
df2.head()

                   location  total_sqft  bath   price  bhk
0  Electronic City Phase II      1056.0   2.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0  120.00    4
2               Uttarahalli      1440.0   2.0   62.00    3
3        Lingadheeranahalli      1521.0   3.0   95.00    3
4                  Kothanur      1200.0   2.0   51.00    2

In [31]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13246 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13246 non-null  object
 1   total_sqft  13200 non-null  float64
 2   bath        13246 non-null  float64
 3   price       13246 non-null  float64
 4   bhk         13246 non-null  int64
dtypes: float64(3), int64(1), object(1)
memory usage: 620.9+ KB

In [32]:
df2['price_per_sqft'] = (df2['price']*100000)/df2['total_sqft']

In [33]:
df2.head()

                   location  total_sqft  bath   price  bhk  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07    2     3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00    4     4615.384615
2               Uttarahalli      1440.0   2.0   62.00    3     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00    3     6245.890861
4                  Kothanur      1200.0   2.0   51.00    2     4250.000000

In [34]:
df2.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13246.000000  13246.000000  13246.000000    1.320000e+04
mean    1563.466767      2.692586    112.389392      2.801902    7.903582e+03
std     1246.451554      1.341506    149.076587      1.295758    1.067277e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.237918e+03
50%     1277.000000      2.000000     72.000000      3.000000    5.417545e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.307886e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [35]:
pd.set_option('display.float_format', lambda x: '%.5f' % x)

In [36]:
df2.describe()

       total_sqft        bath       price         bhk  price_per_sqft
count 13200.00000 13246.00000 13246.00000 13246.00000     13200.00000
mean   1563.46677     2.69259   112.38939     2.80190      7903.58229
std    1246.45155     1.34151   149.07659     1.29576    106727.69113
min       1.00000     1.00000     8.00000     1.00000       267.82981
25%    1100.00000     2.00000    50.00000     2.00000      4237.91822
50%    1277.00000     2.00000    72.00000     3.00000      5417.54502
75%    1680.00000     3.00000   120.00000     3.00000      7307.88617
max   52272.00000    40.00000  3600.00000    43.00000  12000000.00000

In [37]:
pd.reset_option('display.float_format')

In [38]:
df2.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13246.000000  13246.000000  13246.000000    1.320000e+04
mean    1563.466767      2.692586    112.389392      2.801902    7.903582e+03
std     1246.451554      1.341506    149.076587      1.295758    1.067277e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.237918e+03
50%     1277.000000      2.000000     72.000000      3.000000    5.417545e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.307886e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [39]:
df2['price_per_sqft'] = (df2['price']*100000)/df2['total_sqft']

In [40]:
df2.head()

                   location  total_sqft  bath   price  bhk  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07    2     3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00    4     4615.384615
2               Uttarahalli      1440.0   2.0   62.00    3     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00    3     6245.890861
4                  Kothanur      1200.0   2.0   51.00    2     4250.000000

In [41]:
df2.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13246.000000  13246.000000  13246.000000    1.320000e+04
mean    1563.466767      2.692586    112.389392      2.801902    7.903582e+03
std     1246.451554      1.341506    149.076587      1.295758    1.067277e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.237918e+03
50%     1277.000000      2.000000     72.000000      3.000000    5.417545e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.307886e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [42]:
df2.location.unique()

array(['Electronic City Phase II', 'Chikka Tirupathi', 'Uttarahalli', ...,
       '12th cross srinivas nagar banshankari 3rd stage',
       'Havanur extension', 'Abshot Layout'], dtype=object)

In [43]:
len(df2.location.unique())

1304

In [44]:
df2.groupby('location')['location'].value_counts()

location              location
 Anekal                Anekal                 1
 Banaswadi             Banaswadi              1
 Basavangudi           Basavangudi            1
 Bhoganhalli           Bhoganhalli            1
 Devarabeesana Halli   Devarabeesana Halli    6
                                             ..
t.c palya             t.c palya               1
tc.palya              tc.palya                4
vinayakanagar         vinayakanagar           1
white field,kadugodi  white field,kadugodi    1
whitefiled            whitefiled              1
Name: location, Length: 1304, dtype: int64

In [47]:
location_stats = df2.groupby('location')['location'].agg('count').sort_values(ascending = False)
location_stats

location
Whitefield             534
Sarjapur  Road         392
Electronic City        302
Kanakpura Road         266
Thanisandra            233
                      ...
 Banaswadi               1
Kanakadasa Layout        1
Kanakapur main road      1
Kanakapura  Rod          1
whitefiled               1
Name: location, Length: 1304, dtype: int64

In [48]:
less_than_10 = location_stats[location_stats <10]

In [49]:
less_than_10

location
Kamakshipalya            9
Kaverappa Layout         9
Yemlur                   9
Sector 1 HSR Layout      9
4th Block Koramangala    9
                        ..
 Banaswadi               1
Kanakadasa Layout        1
Kanakapur main road      1
Kanakapura  Rod          1
whitefiled               1
Name: location, Length: 1051, dtype: int64

In [50]:
len(less_than_10)

1051

In [51]:
df2['location']

0        Electronic City Phase II
1                Chikka Tirupathi
2                     Uttarahalli
3              Lingadheeranahalli
4                        Kothanur
                   ...
13315                  Whitefield
13316               Richards Town
13317       Raja Rajeshwari Nagar
13318             Padmanabhanagar
13319                Doddathoguru
Name: location, Length: 13246, dtype: object

In [52]:
df2['location'] = df2['location'].apply(lambda x : 'Others' if x in less_than_10 else x)

In [53]:
df2['location']

0        Electronic City Phase II
1                Chikka Tirupathi
2                     Uttarahalli
3              Lingadheeranahalli
4                        Kothanur
                   ...
13315                  Whitefield
13316                      Others
13317       Raja Rajeshwari Nagar
13318             Padmanabhanagar
13319                Doddathoguru
Name: location, Length: 13246, dtype: object

In [54]:
df2.groupby('location')['location'].agg('count').sort_values(ascending = False)

location
Others                   2776
Whitefield                534
Sarjapur  Road            392
Electronic City           302
Kanakpura Road            266
                         ...
BTM 1st Stage              10
1st Block Koramangala      10
Dairy Circle               10
Sadashiva Nagar            10
Nagappa Reddy Layout       10
Name: location, Length: 254, dtype: int64

In [55]:
df2['location'] = df2['location'].apply(lambda x :str(x))

In [56]:
df2['location'] = df2['location'].apply(lambda x : x.strip())

In [57]:
df2.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13200.000000  13246.000000  13246.000000  13246.000000    1.320000e+04
mean    1563.466767      2.692586    112.389392      2.801902    7.903582e+03
std     1246.451554      1.341506    149.076587      1.295758    1.067277e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.237918e+03
50%     1277.000000      2.000000     72.000000      3.000000    5.417545e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.307886e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [58]:
pd.set_option('display.float_format', lambda x: '%.5f' % x)

In [59]:
df2.describe()

       total_sqft        bath       price         bhk  price_per_sqft
count 13200.00000 13246.00000 13246.00000 13246.00000     13200.00000
mean   1563.46677     2.69259   112.38939     2.80190      7903.58229
std    1246.45155     1.34151   149.07659     1.29576    106727.69113
min       1.00000     1.00000     8.00000     1.00000       267.82981
25%    1100.00000     2.00000    50.00000     2.00000      4237.91822
50%    1277.00000     2.00000    72.00000     3.00000      5417.54502
75%    1680.00000     3.00000   120.00000     3.00000      7307.88617
max   52272.00000    40.00000  3600.00000    43.00000  12000000.00000